<?php

array(
    'гатнапуццы' => array(
        'ыупвар' => array(
            0 => 'ывпа',
        ),
    ),
    'Продукты' => array(
        'про' => array(
            0 => 'Ручка',
        ),
        'Томаты' => array(
            0 => 'пшенка',
            1 => 'Богатырь',
        ),
    ),
    'фыва' => array(
        'про' => array(
            0 => 'лдж',
        ),
    ),
    'Электроника' => array(
        'Томаты' => array(
            0 => 'asdfssfa',
        ),
        'Бытовые приборы' => array(
            0 => 'Фен',
            1 => 'Ручка',
        ),
        'Трансформаторы' => array(
            0 => 'Повышающие',
            1 => 'Понижающие',
        ),
        'ыупвар' => array(
            0 => 'sadfasdf',
        ),
    ),
);

array(
    'гатнапуццы' => array(
        'ыупвар' => array(
            9 => array(
                0 => 'ывпа',
            ),
        ),
    ),
    'Продукты' => array(
        'про' => array(
            7 => array(
                0 => 'Ручка',
            ),
        ),
        'Томаты' => array(
            10 => array(
                0 => 'пшенка',
            ),
            8 => array(
                0 => 'Богатырь',
            ),
        ),
    ),
    'фыва' => array(
        'про' => array(
            5 => array(
                0 => 'лдж',
            ),
        ),
    ),
    'Электроника' => array(
        'Томаты' => array(
            12 => array(
                0 => 'asdfssfa',
            ),
        ),
        'Бытовые приборы' => array(
            1 => array(
                0 => 'Фен',
            ),
            6 => array(
                0 => 'Ручка',
            ),
        ),
        'Трансформаторы' => array(
            4 => array(
                0 => 'Повышающие',
            ),
            3 => array(
                0 => 'Понижающие',
            ),
        ),
        'ыупвар' => array(
            13 => array(
                0 => 'sadfasdf',
            ),
        ),
    ),
);
